# FrictionFactor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FrictionFactor Property
ParameterTypeId Class See Also
---
"Friction Factor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FrictionFactor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FrictionFactor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FrictionFactor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace